pduncans/DA-48-tester/boards.txt
# See: https://github.com/arduino/Arduino/wiki/Arduino-IDE-1.5-3rd-party-Hardware-specification


menu.chip=Chip

menu.default.bodvoltage=BOD level if enabled (Bootload burn req'd)
menu.default.bodmode=BOD Mode Active/Sleeping (Bootload burn req'd)
menu.default.eesave=Save EEPROM (Bootload burn req'd)
menu.default.resetpin=Reset pin function (Bootload burn req'd)
menu.default.startuptime=Startup Time (Bootload burn req'd)
menu.bootloaderusart=Bootloader Serial Port (Bootload burn req'd)
menu.timeout=Bootloader Timeout (Bootload burn req'd)
menu.default.appspm=Flash Writing

##############################################################

# BOARD NAMES

avrda.name=AVR DA-series



##############################################################



##########################################################################
#                                                                        #
###                 ###  #     # ####      ####   ###                  ###
#####              #   # #     # #   #     #   # #   #               #####
#######            #####  #   #  ####  ### #   # #####             #######
#####              #   #   # #   # #       #   # #   #               #####
###                #   #    #    #  #      ####  #   #                 ###
#________________________________________________________________________#


################################
# Constant across all settings #
################################

avrda.upload.tool=avrdude

# Build settings
avrda.build.board=avrda
avrda.build.core=dxcore
avrda.build.text_section_start=.text=0x0
avrda.build.extra_flags={build.millis} -DCLOCK_SOURCE={build.clocksource} {bootloader.appspm}
avrda.build.export_merged_output=false
avrda.build.mcupostfix=

# Bootloading settings
avrda.bootloader.tool=avrdude
avrda.bootloader.WDTCFG=0x00
avrda.bootloader.BODCFG={bootloader.bodlevbits}{bootloader.bodmodebits}
avrda.bootloader.SYSCFG0=0b1100{bootloader.resetpinbits}0{bootloader.eesavebit}
avrda.bootloader.CODESIZE=0x00
avrda.bootloader.BOOTSIZE=0x01
avrda.bootloader.avrdudestring=
avrda.bootloader.pymcuprogstring=-aerase

################################
# Tools Submenu Options        #
################################

# App SPM
avrda.menu.appspm.no=Disabled
avrda.menu.appspm.no.bootloader.appspm=
avrda.menu.appspm.no.bootloader.BOOTSIZE=0x00


# Chip (pins and memory size)

avrda.menu.chip.128DA48=AVR128DA48
avrda.menu.chip.128DA48.build.mcu=avr128da48
avrda.menu.chip.128DA48.upload.maximum_size=131072
avrda.menu.chip.128DA48.upload.maximum_data_size=16384
avrda.menu.chip.128DA48.build.variant=48pin-standard


# Clock Speed + Source
avrda.menu.clock.24internal=24 MHz internal
avrda.menu.clock.24internal.build.f_cpu=24000000L
avrda.menu.clock.24internal.build.speed=24
avrda.menu.clock.24internal.build.clocksource=0


# BrownOut Detect Options
avrda.menu.bodvoltage.1v9=1.9V
avrda.menu.bodvoltage.1v9.bootloader.bodlevbits=000


# EESAVE option
avrda.menu.eesave.enable=EEPROM retained
avrda.menu.eesave.enable.bootloader.eesavebit=1


# Reset pin as GPIO option
avrda.menu.resetpin.reset=Hardware Reset (recommended)
avrda.menu.resetpin.reset.bootloader.resetpinbits=10

# millis/micros timing source
# TCD0 and RTC not yet supported
avrda.menu.millis.tcb2=TCB2

avrda.build.millis=-DMILLIS_USE_TIMER{build.millistimer}

avrda.menu.millis.tcb2.build.millistimer=B2

#avrda.menu.millis.rtc.build.millistimer=RTC
#avrda.menu.millis.rtcxtal.build.millistimer=RTC_XTAL
#avrda.menu.millis.rtcxosc.build.millistimer=RTC_XOSC
avrda.menu.millis.disabled.build.millistimer=NONE

# Startup Time
avrda.menu.startuptime.8= 8ms
avrda.menu.startuptime.8.bootloader.SYSCFG1=0x04

